Repository: Justintunsday/where-my-bus-now
Catalog: HKBusETA/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# common.favorite
source: Favorite
zh_hans: 收藏
zh_hant: 收藏

# common.ok
source: OK
zh_hans: 确定
zh_hant: 確定

# common.retry
source: Retry
zh_hans: 重试
zh_hant: 重試

# common.unfavorite
source: Unfavorite
zh_hans: 取消收藏
zh_hant: 取消收藏

# navigation.amapUnavailable
source: Unable to open AMap. Please install AMap and try again.
zh_hans: 无法打开高德地图，请先安装高德地图后重试。
zh_hant: 無法開啟高德地圖，請先安裝高德地圖後再試。

# navigation.error.title
source: Navigation unavailable
zh_hans: 无法导航
zh_hant: 無法導航

# navigation.invalidLocation
source: This station does not have a valid location.
zh_hans: 此车站没有有效位置。
zh_hant: 此車站沒有有效位置。

# navigation.navigate
source: Navigate to station
zh_hans: 导航到车站
zh_hant: 導航到車站

# navigation.openMapFailed
source: Unable to open Apple Maps. Please try again.
zh_hans: 无法打开 Apple 地图，请稍后重试。
zh_hant: 無法開啟 Apple 地圖，請稍後再試。

# error.dataDownloadFailed
source: Failed to download route data. Please check your connection.
zh_hans: 路线数据下载失败，请检查网络连接。
zh_hant: 路線資料下載失敗，請檢查網絡連線。

# error.dataParseFailed
source: Failed to read route data.
zh_hans: 路线数据解析失败。
zh_hant: 路線資料解析失敗。

# error.mainland.requestFailed
source: Mainland transit data is temporarily unavailable. Please try again.
zh_hans: 内地交通数据暂时不可用，请稍后重试。
zh_hant: 內地交通數據暫時不可用，請稍後重試。

# error.mainland.realtimeUnavailable
source: Realtime arrivals are not available from the configured data source.
zh_hans: 当前配置的数据源没有提供实时到站预报。
zh_hant: 目前配置的數據源沒有提供實時到站預報。

# error.noData.message
source: Route data needs to be downloaded once. Connect to the internet and try again.
zh_hans: 首次使用需要下载路线数据，请连接网络后重试。
zh_hant: 首次使用需要下載路線資料，請連接網絡後重試。

# error.noData.title
source: Route data unavailable
zh_hans: 未能加载路线数据
zh_hant: 未能載入路線資料

# eta.arrivalTime
source: Arrival
zh_hans: 到达时间
zh_hant: 到達時間

# eta.arriving
source: Arriving
zh_hans: 即将到达
zh_hant: 即將到達

# eta.currentStop
source: Stop
zh_hans: 车站
zh_hant: 車站

# eta.noEta
source: No upcoming arrival
zh_hans: 暂无到站预报
zh_hant: 暫無到站預報

# eta.noServiceToday
source: No service today
zh_hans: 今日没有服务
zh_hant: 今日沒有服務

# eta.scheduled
source: Scheduled
zh_hans: 预定班次
zh_hant: 預定班次

# eta.section.schedule
source: Schedule
zh_hans: 班次
zh_hant: 班次

# eta.section.upcoming
source: Upcoming
zh_hans: 到站时间
zh_hant: 到站時間

# eta.updatedAt
source: Updated
zh_hans: 更新时间
zh_hant: 更新時間

# favorites.empty.message
source: Tap the star on a route or stop to save it here.
zh_hans: 在路线或车站页面点按星号即可收藏。
zh_hant: 在路線或車站頁面點按星號即可收藏。

# favorites.empty.title
source: No favorites yet
zh_hans: 尚未有收藏
zh_hant: 尚未有收藏

# favorites.routes
source: Routes
zh_hans: 路线
zh_hant: 路線

# favorites.stops
source: Stops
zh_hans: 车站
zh_hant: 車站

# favorites.title
source: Favorites
zh_hans: 收藏
zh_hant: 收藏

# nearby.denied.message
source: Enable location access in Settings to find stops near you.
zh_hans: 请在系统设置中开启定位权限，以搜索附近的车站。
zh_hant: 請在系統設定中開啟定位權限，以搜尋附近的車站。

# nearby.denied.title
source: Location access denied
zh_hans: 定位权限已拒绝
zh_hant: 定位權限已拒絕

# nearby.locating
source: Finding nearby stops...
zh_hans: 正在搜索附近车站…
zh_hant: 正在搜尋附近車站…

# nearby.openSettings
source: Open Settings
zh_hans: 打开设置
zh_hant: 開啟設定

# nearby.permission.button
source: Allow location access
zh_hans: 允许访问位置
zh_hant: 允許存取位置

# nearby.permission.message
source: Your location is used to find nearby bus stops, and is never uploaded.
zh_hans: 你的位置只会用于搜索附近车站，不会上传。
zh_hant: 你的位置只會用於搜尋附近車站，不會上傳。

# nearby.permission.title
source: Nearby stops
zh_hans: 附近车站
zh_hant: 附近車站

# nearby.title
source: Nearby
zh_hans: 附近
zh_hant: 附近

# route.every
source: Every
zh_hans: 每
zh_hant: 每

# route.fare
source: Fare
zh_hans: 收费
zh_hant: 收費

# route.fullEta
source: Full ETA
zh_hans: 完整到站时间
zh_hant: 完整到站時間

source: Route not found
zh_hans: 找不到路线
zh_hant: 找不到路線

# route.reverse
source: Opposite direction
zh_hans: 切换方向
zh_hant: 切換方向

# route.section.stops
source: Stops
zh_hans: 沿途车站
zh_hant: 沿途車站

# route.special
source: Special
zh_hans: 特别班次
zh_hant: 特別班次

# route.to
source: To
zh_hans: 往
zh_hant: 往

# search.empty.hint
source: Search by route number or stop name.
zh_hans: 输入路线号码或车站名称开始搜索。
zh_hant: 輸入路線號碼或車站名稱開始搜尋。

# search.noResults
source: No results
zh_hans: 找不到结果
zh_hant: 找不到結果

# search.noResults.hint
source: Try another route number or stop name.
zh_hans: 请尝试其他路线号码或车站名称。
zh_hant: 請嘗試其他路線號碼或車站名稱。

# search.placeholder
source: Route number or stop name
zh_hans: 路线号码或车站名称
zh_hant: 路線號碼或車站名稱

# search.recent.routes
source: Recent routes
zh_hans: 最近查看的路线
zh_hant: 最近查看的路線

# search.recent.stops
source: Recent stops
zh_hans: 最近查看的车站
zh_hant: 最近查看的車站

# search.section.routes
source: Routes
zh_hans: 路线
zh_hant: 路線

# search.section.stops
source: Stops
zh_hans: 车站
zh_hant: 車站

# search.title
source: Search
zh_hans: 搜索
zh_hant: 搜尋

# settings.about
source: About
zh_hans: 关于
zh_hant: 關於

# settings.about.attribution
source: ETA data from DATA.GOV.HK and transport operators. Route and fare data from HK Bus Crawling@2021.
zh_hans: 到站数据来自数据一站通及各营运商，路线及收费数据来自 HK Bus Crawling@2021。
zh_hant: 到站資料來自資料一站通及各營運商，路線及收費資料來自 HK Bus Crawling@2021。

# settings.about.disclaimer
source: This is an unofficial app. Data is provided for reference only.
zh_hans: 本程序非官方应用，数据仅供参考。
zh_hant: 本程式非官方應用，資料僅供參考。

# settings.about.source
source: Source code
zh_hans: 源代码
zh_hant: 原始碼

# settings.about.website
source: Website
zh_hans: 网站
zh_hant: 網站

# settings.annotateScheduled
source: Mark scheduled arrivals
zh_hans: 标示预定班次
zh_hant: 標示預定班次

# settings.data
source: Data
zh_hans: 数据
zh_hant: 資料

# settings.data.lastUpdated
source: Loaded
zh_hans: 加载时间
zh_hant: 載入時間

# settings.data.refresh
source: Check for data updates
zh_hans: 检查数据更新
zh_hant: 檢查資料更新

# settings.etaFormat
source: ETA display
zh_hans: 到站时间显示
zh_hant: 到站時間顯示

# settings.etaFormat.diff
source: Minutes
zh_hans: 到站时差
zh_hant: 到站時差

# settings.etaFormat.exact
source: Clock time
zh_hans: 到站时间
zh_hant: 到站時間

# settings.etaFormat.mixed
source: Clock time + minutes
zh_hans: 到站时间（到站时差）
zh_hant: 到站時間（到站時差）

# settings.general
source: General
zh_hans: 通用
zh_hant: 一般

# chelaile.metroStart
source: Origin
zh_hans: 起点站
zh_hant: 起點站

# chelaile.metroEnd
source: Terminus
zh_hans: 终点站
zh_hant: 終點站

# chelaile.metroNotice
source: This data source does not provide intermediate metro stops. Open a stop page to see the metro lines serving it.
zh_hans: 此数据源不提供地铁沿途站点；可在车站页查看经过的地铁线路。
zh_hant: 此數據源不提供地鐵沿途站點；可在車站頁查看經過的地鐵線路。

# chelaile.metros
source: Metro
zh_hans: 地铁
zh_hant: 地鐵

# chelaile.loadFailed
source: Failed to load route data
zh_hans: 无法加载路线数据
zh_hant: 無法載入路線資料

# chelaile.scheduled
source: Scheduled
zh_hans: 定时班次
zh_hant: 定時班次

# mainland.loadFailed
source: Failed to load mainland route data
zh_hans: 无法加载内地线路数据
zh_hant: 無法載入內地路線資料

# mainland.metroStart
source: Origin
zh_hans: 起点站
zh_hant: 起點站

# mainland.metroEnd
source: Terminus
zh_hans: 终点站
zh_hant: 終點站

# mainland.metroNotice
source: This data source does not provide intermediate metro stops.
zh_hans: 此数据源不提供地铁沿途站点。
zh_hant: 此數據源不提供地鐵沿途站點。

# mainland.metroPayloadUnavailable
source: The complete metro stop sequence is temporarily unavailable from this data source.
zh_hans: 当前数据源未返回完整地铁站序，已保留起终点信息。
zh_hant: 目前數據源未返回完整地鐵站序，已保留起訖站信息。

# mainland.metroNoRealtime
source: Metro realtime arrivals are not available yet.
zh_hans: 地铁目前没有实时到站数据。
zh_hant: 地鐵目前沒有實時到站數據。

# mainland.firstDeparture
source: First departure
zh_hans: 首班
zh_hant: 首班

# mainland.lastDeparture
source: Last departure
zh_hans: 末班
zh_hant: 末班

# mainland.metros
source: Metro
zh_hans: 地铁
zh_hant: 地鐵

# mainland.source.amap
source: AMap official base data
zh_hans: 高德官方基础数据
zh_hant: 高德官方基礎數據

# mainland.source.chelaileAPI
source: CheLaile API primary
zh_hans: 车来了 API 主接口
zh_hant: 車來了 API 主接口

# mainland.source.authorizedRealtime
source: Authorized realtime feed
zh_hans: 已授权实时数据源
zh_hant: 已授權實時數據源

# mainland.source.legacy
source: Legacy compatibility fallback
zh_hans: Legacy 兼容后备
zh_hant: Legacy 兼容後備

# mainland.source.composite
source: CheLaile API primary · legacy direct fallback
zh_hans: 车来了 API 主接口 · 旧直连备用
zh_hant: 車來了 API 主接口 · 舊直連後備

# settings.region
source: Region
zh_hans: 地区
zh_hant: 地區

# settings.region.auto
source: Auto (current location)
zh_hans: 自动（跟随定位）
zh_hant: 自動（跟隨定位）

# settings.region.mainlandNotice
source: CheLaile API is the primary mainland source. AMap is used only as an official base-data fallback when configured; legacy direct CheLaile is the final fallback. All data is for reference only.
zh_hans: 内地主接口为车来了 API；配置 AMAP_WEB_SERVICE_KEY 后，高德仅作官方基础数据备用，旧车来了直连为最终备用。数据仅供参考。
zh_hant: 內地主接口為車來了 API；設定 AMAP_WEB_SERVICE_KEY 後，高德僅作官方基礎資料後備，舊車來了直連為最終後備。資料僅供參考。

# settings.region.realtimeNotice
source: Realtime ETA uses the CheLaile API primary. If it fails, the legacy direct API is used; AMap is never presented as realtime.
zh_hans: 实时到站由车来了 API 主接口提供；失败时使用旧车来了直连备用，高德不会被标示为实时数据。
zh_hant: 實時到站由車來了 API 主接口提供；失敗時使用舊車來了直連後備，高德不會被標示為實時數據。

# settings.region.dataSource
source: Mainland data source
zh_hans: 内地数据源
zh_hant: 內地數據源

# settings.region.amapKey
source: AMAP_WEB_SERVICE_KEY is read from the generated Info.plist or process environment. It is never bundled as a source-code constant.
zh_hans: AMAP_WEB_SERVICE_KEY 会从生成的 Info.plist 或进程环境读取，不会写入源代码常量。
zh_hant: AMAP_WEB_SERVICE_KEY 會從生成的 Info.plist 或進程環境讀取，不會寫入源碼常量。

# settings.region.chelaileAPI
source: CHELAILE_API_BASE_URL and optional CHELAILE_API_KEY are read from generated Info.plist or process environment. The default is the hosted /v1 API; no key is bundled in source.
zh_hans: CHELAILE_API_BASE_URL 及可选 CHELAILE_API_KEY 会从生成的 Info.plist 或进程环境读取；默认使用托管 /v1 API，密钥不会写入源代码。
zh_hant: CHELAILE_API_BASE_URL 及可選 CHELAILE_API_KEY 會從生成的 Info.plist 或進程環境讀取；預設使用託管 /v1 API，密鑰不會寫入源碼。

# settings.region.current
source: Current region
zh_hans: 当前地区
zh_hant: 目前地區

# settings.language
source: Language
zh_hans: 语言
zh_hant: 語言

# settings.language.system
source: System
zh_hans: 跟随系统
zh_hant: 跟隨系統

# settings.title
source: Settings
zh_hans: 设置
zh_hant: 設定

# settings.version
source: Version
zh_hans: 版本
zh_hant: 版本

# status.checkingUpdate
source: Checking for updates...
zh_hans: 正在检查更新…
zh_hant: 正在檢查更新…

# status.downloading
source: Downloading route data...
zh_hans: 正在下载路线数据…
zh_hant: 正在下載路線資料…

# status.firstLaunchHint
source: The route database (~8 MB) is downloaded once on first launch, then served from the local cache.
zh_hans: 首次启动需下载路线数据（约 8 MB），之后会使用本地缓存。
zh_hant: 首次啟動需下載路線資料（約 8 MB），之後會使用本機快取。

# status.loading
source: Loading...
zh_hans: 加载中…
zh_hant: 載入中…

# status.processing
source: Processing route data...
zh_hans: 正在处理路线数据…
zh_hant: 正在處理路線資料…

# stop.noRoutes
source: No routes serve this stop
zh_hans: 此车站没有路线
zh_hant: 此車站沒有路線

# stop.section.routes
source: Routes at this stop
zh_hans: 途经路线
zh_hant: 途經路線

# tab.favorites
source: Favorites
zh_hans: 收藏
zh_hant: 收藏

# tab.nearby
source: Nearby
zh_hans: 附近
zh_hant: 附近

# tab.search
source: Search
zh_hans: 搜索
zh_hant: 搜尋

# tab.settings
source: Settings
zh_hans: 设置
zh_hant: 設定

# unit.minutes
source: min
zh_hans: 分钟
zh_hant: 分鐘

# unit.routes
source: routes
zh_hans: 条路线
zh_hant: 條路線

# unit.stops
source: stops
zh_hans: 个站
zh_hant: 個站
